; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	image1 - mode
	infrared2 - mode
	spectrograph0 - mode
	Star0 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	GroundStation8 - direction
	GroundStation11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	GroundStation2 - direction
	Star9 - direction
	Star7 - direction
	Star10 - direction
	Star15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument1 spectrograph0)
	(supports instrument1 image1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star9)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument2 infrared2)
	(supports instrument2 image1)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 Star9)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
)
(:goal (and
	(pointing satellite1 Planet19)
	(pointing satellite2 Star15)
	(have_image Star15 spectrograph0)
	(have_image Phenomenon16 image1)
	(have_image Phenomenon17 infrared2)
	(have_image Phenomenon18 infrared2)
	(have_image Planet19 spectrograph0)
))

)

; plan
1. (turn_to satellite1 star9 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star9)
   goals met: 0 of 7
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 7
3. (calibrate satellite1 instrument1 star9)
   added: (calibrated instrument1)
   goals met: 0 of 7
4. (turn_to satellite1 phenomenon18 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon18)
   goals met: 0 of 7
5. (take_image satellite1 phenomenon18 instrument1 infrared2)
   added: (have_image phenomenon18 infrared2)
   goals met: 1 of 7
6. (turn_to satellite1 phenomenon17 phenomenon18)
   deleted: (pointing satellite1 phenomenon18)
   added: (pointing satellite1 phenomenon17)
   goals met: 1 of 7
7. (take_image satellite1 phenomenon17 instrument1 infrared2)
   added: (have_image phenomenon17 infrared2)
   goals met: 2 of 7
8. (turn_to satellite1 phenomenon16 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon16)
   goals met: 2 of 7
9. (take_image satellite1 phenomenon16 instrument1 image1)
   added: (have_image phenomenon16 image1)
   goals met: 3 of 7
10. (turn_to satellite1 star15 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 star15)
   goals met: 3 of 7
11. (take_image satellite1 star15 instrument1 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 4 of 7
12. (turn_to satellite1 planet19 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 planet19)
   goals met: 5 of 7
13. (take_image satellite1 planet19 instrument1 spectrograph0)
   added: (have_image planet19 spectrograph0)
   goals met: 6 of 7
14. (turn_to satellite2 star15 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 star15)
   goals met: 7 of 7
